In [1]:
import pandas as pd
import numpy as np

# Juntando bases (linhas diferentes, mesmas colunas)

Vamos supor que você extraiu dados de um servidor sobre as vendas de suas lojas no sudeste. Depois você extraiu os dados de outro servidor sobre as vendas de suas lojas nos demais estados. Como juntar essas bases de lugares diferentes, mas com dados de colunas iguais?

Para realizar tal tarefa, iremos utilizar a função `.concat()`. Iremos juntar 2 dataframes que apresentam as mesmas colunas, mas com dados diferentes nas linhas.

- [Documentação do método concat](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html)

In [2]:
matriz0 = [["SP", 18, 5000, "Pudim"],
           ["MG", 20, 5100, "Chocolate"],
           ["RJ", 3,  600,  "Maria Mole"]]
data0 = pd.DataFrame(matriz0, columns = ["Estado", "Número de lojas",
                                        "Vendas de Doce de Abóbora/dia",
                                        "Doce mais vendido"])

matriz1 = [["RN", 22, 7800, "Pudim"],
           ["RS", 11, 514,  "Chocolate"],
           ["TO", 6,  680,  "Doce de Leite"]]
data1 = pd.DataFrame(matriz1, columns=["Estado", "Número de lojas",
                                       "Vendas de Doce de Abóbora/dia",
                                       "Doce mais vendido"])

In [3]:
data0

  Estado  Número de lojas  Vendas de Doce de Abóbora/dia Doce mais vendido
0     SP               18                           5000             Pudim
1     MG               20                           5100         Chocolate
2     RJ                3                            600        Maria Mole

In [4]:
data1

  Estado  Número de lojas  Vendas de Doce de Abóbora/dia Doce mais vendido
0     RN               22                           7800             Pudim
1     RS               11                            514         Chocolate
2     TO                6                            680     Doce de Leite

In [5]:
data=pd.concat([data0, data1])
data

  Estado  Número de lojas  Vendas de Doce de Abóbora/dia Doce mais vendido
0     SP               18                           5000             Pudim
1     MG               20                           5100         Chocolate
2     RJ                3                            600        Maria Mole
0     RN               22                           7800             Pudim
1     RS               11                            514         Chocolate
2     TO                6                            680     Doce de Leite

# Juntando bases (linhas iguais, colunas diferentes)

Agora vamos supor que você extraiu dados de um outro banco de dados sobre a média de visitantes em suas lojas, mas você quer analisar junto ao dataset que apresenta os dados sobre o número de lojas por estado.

Para realizar tal tarefa, iremos utilizar a função merge. Iremos juntar 2 dataframes que apresentam as colunas diferentes, mas que podem ser ligados por uma coluna em comum (no caso o Estado).

- [Documentação do método merge](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html)

In [6]:
matriz3 = [["RN", 1370],
           ["SP", 700],
           ["TO", 992],
           ["MG", 1800],
           ["RJ", 709],
           ["RS", 1563]]
data3 = pd.DataFrame(matriz3, columns=["Estado", "Média de pessoas por loja e dia"])
data3

  Estado  Média de pessoas por loja e dia
0     RN                             1370
1     SP                              700
2     TO                              992
3     MG                             1800
4     RJ                              709
5     RS                             1563

In [7]:
data_complete = data.merge(data3, on="Estado", how="left")
data_complete

,Estado,Número de lojas,Vendas de Doce de Abóbora/dia,Doce mais vendido,Média de pessoas por loja e dia
0,SP,18,5000,Pudim,700
1,MG,20,5100,Chocolate,1800
2,RJ,3,600,Maria Mole,709
3,RN,22,7800,Pudim,1370
4,RS,11,514,Chocolate,1563
5,TO,6,680,Doce de Leite,992